app/Controllers/Admin.php

SELECT *
FROM `recipe_category`
---
    public function recipeCategory()
    {
        $model = new RecipeCategoryModel();

        $data['recipeCategory'] = $model->findAll();