app/Controllers/Admin.php

SELECT *
FROM `tags`
---
    public function blogTags()
    {

        $model = new TagsModel();

        $data['tags'] = $model->findAll();

INSERT INTO `tags` (`name`, `created_at`, `updated_at`) VALUES ('Seafood', '2026-07-06 12:45:55', '2026-07-06 12:45:55')
---
    public function storeTags()
    {
        $model = new TagsModel();

        $data = [
            'name' => $this->request->getPost('name')
        ];

        if ($model->insert($data)) {

SELECT *
FROM `tags`
WHERE `tags`.`id` = '8'
UPDATE `tags` SET `name` = 'Mughlai', `updated_at` = '2026-07-06 12:38:13'
WHERE `tags`.`id` IN ('8')
SELECT *
FROM `blogs`
WHERE JSON_SEARCH(tags, 'one', 'Mughal') IS NOT NULL
---
    public function updateTags()
    {
        $id = $this->request->getPost('id');
        $newName = trim($this->request->getPost('name'));

        $tagsModel = new TagsModel();
        $blogsModel = new BlogModel();


        $tag = $tagsModel->find($id);

        if (!$tag) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Tag not found'
            ]);
        }

        $oldName = $tag['name'];

        $tagUpdated = $tagsModel->update($id, ['name' => $newName]);

        $blogs = $blogsModel
            ->where("JSON_SEARCH(tags, 'one', '{$oldName}') IS NOT NULL")
            ->findAll();

UPDATE `blogs` SET `tags` = '[\"Continental\",\"Mughlai\"]', `updated_at` = '2026-07-06 12:38:13'
WHERE `blogs`.`id` IN ('16')
---
                $updatedTags[] = ($t === $oldName) ? $newName : $t;
            }

            $blogsModel->update($blog['id'], [
                'tags' => json_encode($updatedTags)
            ]);