app/Controllers/BlogController.php

    public function blog()
    {
        $model = new BlogModel();

        $data['blogs'] = $model->findAll();
---
SELECT *
FROM `blogs`