app/Controllers/Home.php

                ->groupEnd();
        }

        $data = [
            'blogs' => $blogModel->orderBy('date', 'DESC')->paginate(12),
            'pager' => $blogModel->pager,


            'categories' => $categoryModel->orderBy('name', 'ASC')->findAll(),
            'tags' => $tagsModel->orderBy('name', 'ASC')->findAll(),
            'activeCategory' => $category,
            'activeTags' => $tags,
            'search' => $search,
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `blogs`