app/Controllers/Home.php

SELECT *
FROM `recipes`
WHERE `category` = 'new'
ORDER BY `date` DESC
SELECT *
FROM `recipe_category`
ORDER BY `name` ASC
---
    public function recipeList()
    {
         $recipeModel = new RecipeModel();
        $categoryModel = new RecipeCategoryModel();

        $category = trim((string) $this->request->getGet('category'));
        $search = trim((string) $this->request->getGet('search'));

        if ($category !== '') {
            $recipeModel->where('category', $category);
        }

        if ($search !== '') {
            $recipeModel
                ->groupStart()
                ->like('name', $search)
                ->orLike('description', $search)
                ->orLike('category', $search)
                ->groupEnd();
        }

        $data = [
            'recipes' => $recipeModel->orderBy('date', 'DESC')->findAll(),
            'categories' => $categoryModel->orderBy('name', 'ASC')->findAll(),
            'activeCategory' => $category,
            'search' => $search,
        ];

SELECT *
FROM `recipes`
WHERE `slug` = 'first-recipe-blog'
 LIMIT 1
---
    public function singleRecipe($slug)
    {
        $model = new RecipeModel();

         $data['recipedata'] = $model->where('slug', $slug)->first();