app/Controllers/Home.php

    public function index()
    {
        $model = new BlogModel();
        $data['blogdata'] = $model->orderBy('date', 'DESC')
            ->findAll(8);

        $categorymodel = new CategoryModel();

        $data['categories'] = $categorymodel
            ->orderBy('created_at', 'DESC')
            ->findAll(4);
---
SELECT *
FROM `blogs`
ORDER BY `date` DESC
 LIMIT 8
SELECT *
FROM `category`
ORDER BY `created_at` DESC
 LIMIT 4

                ->groupEnd();
        }

        $data = [
            'blogs' => $blogModel->orderBy('date', 'DESC')->findAll(),
            'categories' => $categoryModel->orderBy('name', 'ASC')->findAll(),
            'tags' => $tagsModel->orderBy('name', 'ASC')->findAll(),
            'activeCategory' => $category,
            'activeTags' => $tags,
            'search' => $search,
        ];
---
SELECT *
FROM `category`
ORDER BY `name` ASC
SELECT *
FROM `tags`
ORDER BY `name` ASC
SELECT *
FROM `blogs`
WHERE   (
JSON_CONTAINS(tags, '"Chinese"')
AND JSON_CONTAINS(tags, '"Oriental"')
 )
ORDER BY `date` DESC